@echo off
setlocal enabledelayedexpansion
chcp 65001 > nul

REM Створюємо каталог batch і в ньому каталоги скрытая папка і не скрытая папка
mkdir Лабораторные\Группа\ФИО\batch
mkdir Лабораторные\Группа\ФИО\batch\скрытая_папка
mkdir Лабораторные\Группа\ФИО\batch\не_скрытая_папка

REM Робимо каталог скрытая папка прихованим
attrib +h "Лабораторные\Группа\ФИО\batch\скрытая_папка"

REM Виводимо на екран допомогу з використання команди xcopy
xcopy /?

REM Спрямовуємо вивід допомоги з використання команди xcopy до файла copyhelp.txt в каталозі "не скрытая папка"
xcopy /? > "Лабораторные\Группа\ФИО\batch\не_скрытая_папка\copyhelp.txt"

REM Копіюємо файл copyhelp.txt до каталогу "скрытая папка" та перейменовуємо його в copied_copyhelp.txt
xcopy "Лабораторные\Группа\ФИО\batch\не_скрытая_папка\copyhelp.txt" "Лабораторные\Группа\ФИО\batch\скрытая_папка\copied_copyhelp.txt"

REM Вивід повідомлення про завершення операції
echo Операція завершена.